[
  {
    "toyId": 1,
    "toyName": "Lego Classic Creative Box",
    "sellerName": "Toys R Us Local",
    "sellerEmail": "contact@toysruslocal.com",
    "price": 49.99,
    "rating": 4.7,
    "availableQuantity": 75,
    "description": "The Lego Classic Creative Box is the ultimate open-ended building experience for children. With hundreds of colorful bricks in a variety of shapes and sizes, kids can create houses, cars, animals, or anything their imagination inspires. It promotes logical thinking, fine motor skills, and creativity. Whether playing alone or with friends, this set provides endless hours of fun. It comes in a durable storage box for easy organization and long-lasting playtime enjoyment.",
    "pictureURL": "https://i.postimg.cc/26HG1HWK/lego-Box.jpg",
    "subCategory": "Building Blocks"
  },
  {
    "toyId": 2,
    "toyName": "Hot Wheels 5-Pack Set",
    "sellerName": "Speedy Toys Inc.",
    "sellerEmail": "sales@speedytoys.com",
    "price": 12.50,
    "rating": 4.9,
    "availableQuantity": 150,
    "description": "The Hot Wheels 5-Pack Set features five uniquely designed die-cast cars that deliver thrilling speed and style. Each car is crafted with precision detailing and durable materials, making it perfect for races, stunts, or display. Kids can create their own racing adventures while improving hand-eye coordination and imagination. Ideal for collectors and young enthusiasts alike, this set offers variety and excitement in one package. Compatible with all standard Hot Wheels tracks for non-stop fun.",
    "pictureURL": "https://i.postimg.cc/WbtbP4jB/hot-Wheel.jpg",
    "subCategory": "Die-Cast Vehicles"
  },
  {
    "toyId": 3,
    "toyName": "Barbie Dreamhouse",
    "sellerName": "Dreamland Dolls Co.",
    "sellerEmail": "support@dreamdolls.com",
    "price": 199.99,
    "rating": 4.5,
    "availableQuantity": 30,
    "description": "The Barbie Dreamhouse is a magnificent three-story dollhouse offering endless play possibilities. It includes eight stylish rooms, a working elevator, and over 70 accessories for immersive storytelling. Kids can cook in the kitchen, relax in the living room, or host parties on the rooftop. Its detailed design sparks imagination and creativity, allowing children to explore everyday routines through play. Built from sturdy materials, the Dreamhouse is perfect for hours of role-playing fun and adventure.",
    "pictureURL": "https://i.postimg.cc/BvNn0PLG/barbie-House.jpg",
    "subCategory": "Dolls & Dollhouses"
  },
  {
    "toyId": 4,
    "toyName": "VTech Learning Tablet",
    "sellerName": "EduKids Gear",
    "sellerEmail": "info@edukidsgear.com",
    "price": 75.00,
    "rating": 4.6,
    "availableQuantity": 90,
    "description": "The VTech Learning Tablet combines fun and education in one interactive device. Designed for early learners, it includes engaging games that teach letters, numbers, colors, and basic science concepts. With colorful graphics, responsive touch controls, and sound effects, children stay motivated while learning. The lightweight, durable build ensures safe handling for small hands. It’s a great way to introduce kids to technology while encouraging curiosity, creativity, and problem-solving skills through guided play.",
    "pictureURL": "https://i.postimg.cc/G2W27wT9/vtech.jpg",
    "subCategory": "Educational Toys"
  },
  {
    "toyId": 5,
    "toyName": "Soft Teddy Bear (Giant)",
    "sellerName": "Cuddle Buddies LTD",
    "sellerEmail": "orders@cuddlebuddies.com",
    "price": 35.50,
    "rating": 4.8,
    "availableQuantity": 60,
    "description": "The Giant Soft Teddy Bear from Cuddle Buddies LTD is every child’s favorite snuggle companion. Crafted from ultra-soft, plush material, it offers unmatched comfort and warmth. Its big, huggable body makes it perfect for bedtime cuddles or room décor. The high-quality stitching and durable filling ensure long-lasting use. Whether gifted on birthdays, holidays, or just because, this teddy bear brings joy and comfort to kids and adults alike. A classic keepsake for all ages.",
    "pictureURL": "https://i.postimg.cc/GpD6FWRf/soft-teddy.jpg",
    "subCategory": "Stuffed Animals"
  },
  {
    "toyId": 6,
    "toyName": "Marvel Action Figure Set",
    "sellerName": "Hero Planet Toys",
    "sellerEmail": "sales@heroplanet.com",
    "price": 25.99,
    "rating": 4.7,
    "availableQuantity": 110,
    "description": "The Marvel Action Figure Set brings your favorite superheroes to life with detailed, poseable figures. Each character features authentic costumes and dynamic articulation for action-packed adventures. Kids can recreate epic battles or invent their own superhero missions. Made from high-quality materials, these figures are durable and collectible. Perfect for both play and display, this set encourages imaginative storytelling, teamwork, and creative expression while celebrating the Marvel universe’s legendary heroes.",
    "pictureURL": "https://i.postimg.cc/C1XNc149/Marvel-Action.jpg",
    "subCategory": "Action Figures"
  },
  {
    "toyId": 7,
    "toyName": "Wooden Jigsaw Puzzle (50pc)",
    "sellerName": "Puzzles World",
    "sellerEmail": "contact@puzzlesworld.com",
    "price": 15.75,
    "rating": 4.4,
    "availableQuantity": 85,
    "description": "The Wooden Jigsaw Puzzle from Puzzles World features 50 vibrant pieces that form a colorful jungle scene. Made from premium, eco-friendly wood, the puzzle pieces are smooth, safe, and easy for small hands to handle. It helps develop cognitive skills, hand-eye coordination, and patience. Perfect for quiet playtime or family bonding, this puzzle encourages focus and problem-solving. Once completed, it can be displayed as a beautiful piece of art or replayed again for endless fun.",
    "pictureURL": "https://i.postimg.cc/fTJs3g3D/wood-Pazzle.jpg",
    "subCategory": "Puzzles"
  },
  {
    "toyId": 8,
    "toyName": "Remote Control Drone",
    "sellerName": "Sky High Gadgets",
    "sellerEmail": "support@skyhighgadgets.com",
    "price": 120.00,
    "rating": 4.3,
    "availableQuantity": 40,
    "description": "The Remote Control Drone from Sky High Gadgets offers a thrilling flying experience for kids and beginners. Equipped with a built-in HD camera, it captures stunning aerial photos and videos. Its intuitive controls, altitude hold, and headless mode make flying easy and safe. The drone’s sturdy frame resists minor crashes, ensuring durability. With rechargeable batteries and smooth flight stability, it’s perfect for indoor or outdoor adventures, providing hours of entertainment and discovery.",
    "pictureURL": "https://i.postimg.cc/c1PbBQ0m/dron.jpg",
    "subCategory": "Remote Control"
  },
  {
    "toyId": 9,
    "toyName": "Play-Doh Mega Pack",
    "sellerName": "Creative Kids Co.",
    "sellerEmail": "info@creativekids.com",
    "price": 22.99,
    "rating": 4.7,
    "availableQuantity": 130,
    "description": "The Play-Doh Mega Pack from Creative Kids Co. includes a rainbow of vibrant, non-toxic modeling compounds for endless creativity. Kids can shape, mold, and sculpt anything they dream of—from animals to food creations. The soft texture is easy to handle and encourages fine motor skill development. It’s perfect for classrooms, parties, or at-home play. Stored in resealable tubs, this set provides a mess-free, reusable play experience that sparks imagination in every child.",
    "pictureURL": "https://i.postimg.cc/LXYVJbYj/play-doh.jpg",
    "subCategory": "Arts & Crafts"
  },
  {
    "toyId": 10,
    "toyName": "Baby Rattle and Teether Set",
    "sellerName": "Infant Joy",
    "sellerEmail": "sales@infantjoy.com",
    "price": 9.99,
    "rating": 4.9,
    "availableQuantity": 200,
    "description": "The Baby Rattle and Teether Set by Infant Joy includes three bright, easy-to-grip toys that both entertain and soothe teething babies. Each rattle is made from BPA-free, safe plastic and produces gentle sounds that stimulate sensory development. The ergonomic design fits comfortably in tiny hands, promoting grasping and coordination. It’s lightweight, washable, and ideal for everyday use at home or on the go. A wonderful gift for infants to enjoy safe, joyful playtime.",
    "pictureURL": "https://i.postimg.cc/c4mfLS97/rattle.jpg",
    "subCategory": "Infant & Baby"
  },
  {
    "toyId": 11,
    "toyName": "Magnetic Tiles Set",
    "sellerName": "Geo Builders Inc.",
    "sellerEmail": "contact@geobuilders.com",
    "price": 55.99,
    "rating": 4.8,
    "availableQuantity": 80,
    "description": "The Magnetic Tiles Set from Geo Builders Inc. inspires young minds to explore geometry and design. Featuring durable magnetic pieces in different shapes and colors, kids can build towers, castles, and creative 3D structures. The strong magnets ensure stable connections, while the translucent tiles add a visual appeal under light. This educational toy encourages logical thinking, problem-solving, and creativity. It’s a hands-on way to blend fun with STEM learning and artistic expression.",
    "pictureURL": "https://i.postimg.cc/wMF3g6q7/tiles.jpg",
    "subCategory": "Building Blocks"
  },
  {
    "toyId": 12,
    "toyName": "Kids Science Explorer Kit",
    "sellerName": "Lab Fun Toys",
    "sellerEmail": "support@labfuntoys.com",
    "price": 39.50,
    "rating": 4.5,
    "availableQuantity": 100,
    "description": "The Kids Science Explorer Kit by Lab Fun Toys introduces children to the wonders of scientific discovery. It includes all the tools and materials needed for safe, hands-on experiments like volcano eruptions, crystal growing, and chemical reactions. Each activity is designed to teach basic STEM principles while keeping learning exciting. The kit encourages curiosity, observation, and creativity, making it an ideal choice for classrooms or home education. A perfect gift for young scientists in training.",
    "pictureURL": "https://i.postimg.cc/FKmtg0gH/kid-Science.jpg",
    "subCategory": "Educational Toys"
  }
]
